### 📖 Terraform Plan (infra-io/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_monitor_diagnostic_setting.itn_queue_diagnostic_setting will be created
  + resource "azurerm_monitor_diagnostic_setting" "itn_queue_diagnostic_setting" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.OperationalInsights/workspaces/io-p-law-common"
      + name                           = "io-p-itn-cgn-st-queue-ds-01"
      + target_resource_id             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Storage/storageAccounts/iopitncgnst01/queueServices/default"

      + enabled_log {
          + category       = "StorageWrite"
            # (1 unchanged attribute hidden)
        }

      + log (known after apply)

      + metric {
          + category = "Capacity"
          + enabled  = false
        }
      + metric {
          + category = "Transaction"
          + enabled  = false
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.activated_cgn_failure_alert_rule_itn will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "activated_cgn_failure_alert_rule_itn" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Permanent failures processing Activated CGN. REQUIRED MANUAL ACTION"
      + enabled                                = true
      + evaluation_frequency                   = "PT15M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "italynorth"
      + name                                   = "[CGN | iopitncgnst01] Failures on activatedcgn-poison"
      + resource_group_name                    = "io-p-itn-cgn-rg-01"
      + scopes                                 = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Storage/storageAccounts/iopitncgnst01",
        ]
      + severity                               = 1
      + tags                                   = {
          + "BusinessUnit"   = "CGN"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + window_duration                        = "PT15M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-cgn-error-ag-01",
            ]
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                StorageQueueLogs
                  | where OperationName has "PutMessage"
                  | where Uri has "activatedcgn-poison"
            EOT
          + threshold               = 0
          + time_aggregation_method = "Count"
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.activated_eyca_failure_alert_rule_itn will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "activated_eyca_failure_alert_rule_itn" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Permanent failures processing Activated EYCA. REQUIRED MANUAL ACTION"
      + enabled                                = true
      + evaluation_frequency                   = "PT15M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "italynorth"
      + name                                   = "[CGN | iopitncgnst01] Failures on activatedeyca-poison"
      + resource_group_name                    = "io-p-itn-cgn-rg-01"
      + scopes                                 = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Storage/storageAccounts/iopitncgnst01",
        ]
      + severity                               = 1
      + tags                                   = {
          + "BusinessUnit"   = "CGN"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + window_duration                        = "PT15M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-cgn-error-ag-01",
            ]
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                StorageQueueLogs
                  | where OperationName has "PutMessage"
                  | where Uri has "activatedeyca-poison"
            EOT
          + threshold               = 0
          + time_aggregation_method = "Count"
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.expired_cgn_failure_alert_rule_itn will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "expired_cgn_failure_alert_rule_itn" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Permanent failures processing Expired CGN. REQUIRED MANUAL ACTION"
      + enabled                                = true
      + evaluation_frequency                   = "PT15M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "italynorth"
      + name                                   = "[CGN | iopitncgnst01] Failures on expiredcgn-poison"
      + resource_group_name                    = "io-p-itn-cgn-rg-01"
      + scopes                                 = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Storage/storageAccounts/iopitncgnst01",
        ]
      + severity                               = 1
      + tags                                   = {
          + "BusinessUnit"   = "CGN"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + window_duration                        = "PT15M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-cgn-error-ag-01",
            ]
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                StorageQueueLogs
                  | where OperationName has "PutMessage"
                  | where Uri has "expiredcgn-poison"
            EOT
          + threshold               = 0
          + time_aggregation_method = "Count"
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.expired_eyca_failure_alert_rule_itn will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "expired_eyca_failure_alert_rule_itn" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Permanent failures processing Expired EYCA. REQUIRED MANUAL ACTION"
      + enabled                                = true
      + evaluation_frequency                   = "PT15M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "italynorth"
      + name                                   = "[CGN | iopitncgnst01] Failures on expiredeyca-poison"
      + resource_group_name                    = "io-p-itn-cgn-rg-01"
      + scopes                                 = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Storage/storageAccounts/iopitncgnst01",
        ]
      + severity                               = 1
      + tags                                   = {
          + "BusinessUnit"   = "CGN"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + window_duration                        = "PT15M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-cgn-error-ag-01",
            ]
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                StorageQueueLogs
                  | where OperationName has "PutMessage"
                  | where Uri has "expiredeyca-poison"
            EOT
          + threshold               = 0
          + time_aggregation_method = "Count"
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.messages_failure_alert_rule_itn will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "messages_failure_alert_rule_itn" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Permanent failures processing Messages. REQUIRED MANUAL ACTION"
      + enabled                                = true
      + evaluation_frequency                   = "PT15M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "italynorth"
      + name                                   = "[CGN | iopitncgnst01] Failures on messages-poison"
      + resource_group_name                    = "io-p-itn-cgn-rg-01"
      + scopes                                 = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Storage/storageAccounts/iopitncgnst01",
        ]
      + severity                               = 1
      + tags                                   = {
          + "BusinessUnit"   = "CGN"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + window_duration                        = "PT15M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-cgn-error-ag-01",
            ]
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                StorageQueueLogs
                  | where OperationName has "PutMessage"
                  | where Uri has "messages-poison"
            EOT
          + threshold               = 0
          + time_aggregation_method = "Count"
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.pending_cgn_failure_alert_rule_itn will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "pending_cgn_failure_alert_rule_itn" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Permanent failures processing Pending CGN. REQUIRED MANUAL ACTION"
      + enabled                                = true
      + evaluation_frequency                   = "PT15M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "italynorth"
      + name                                   = "[CGN | iopitncgnst01] Failures on pendingcgn-poison"
      + resource_group_name                    = "io-p-itn-cgn-rg-01"
      + scopes                                 = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Storage/storageAccounts/iopitncgnst01",
        ]
      + severity                               = 1
      + tags                                   = {
          + "BusinessUnit"   = "CGN"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + window_duration                        = "PT15M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-cgn-error-ag-01",
            ]
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                StorageQueueLogs
                  | where OperationName has "PutMessage"
                  | where Uri has "pendingcgn-poison"
            EOT
          + threshold               = 0
          + time_aggregation_method = "Count"
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.pending_eyca_failure_alert_rule_itn will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "pending_eyca_failure_alert_rule_itn" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Permanent failures processing Pending EYCA. REQUIRED MANUAL ACTION"
      + enabled                                = true
      + evaluation_frequency                   = "PT15M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "italynorth"
      + name                                   = "[CGN | iopitncgnst01] Failures on pendingeyca-poison"
      + resource_group_name                    = "io-p-itn-cgn-rg-01"
      + scopes                                 = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Storage/storageAccounts/iopitncgnst01",
        ]
      + severity                               = 1
      + tags                                   = {
          + "BusinessUnit"   = "CGN"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + window_duration                        = "PT15M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-cgn-error-ag-01",
            ]
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                StorageQueueLogs
                  | where OperationName has "PutMessage"
                  | where Uri has "pendingeyca-poison"
            EOT
          + threshold               = 0
          + time_aggregation_method = "Count"
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.pendingdelete_cgn_failure_alert_rule_itn will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "pendingdelete_cgn_failure_alert_rule_itn" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Permanent failures processing Pending Delete CGN. REQUIRED MANUAL ACTION"
      + enabled                                = true
      + evaluation_frequency                   = "PT15M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "italynorth"
      + name                                   = "[CGN | iopitncgnst01] Failures on pendingdeletecgn-poison"
      + resource_group_name                    = "io-p-itn-cgn-rg-01"
      + scopes                                 = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Storage/storageAccounts/iopitncgnst01",
        ]
      + severity                               = 1
      + tags                                   = {
          + "BusinessUnit"   = "CGN"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + window_duration                        = "PT15M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-cgn-error-ag-01",
            ]
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                StorageQueueLogs
                  | where OperationName has "PutMessage"
                  | where Uri has "pendingdeletecgn-poison"
            EOT
          + threshold               = 0
          + time_aggregation_method = "Count"
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.pendingdelete_eyca_failure_alert_rule_itn will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "pendingdelete_eyca_failure_alert_rule_itn" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Permanent failures processing Pending Delete EYCA. REQUIRED MANUAL ACTION"
      + enabled                                = true
      + evaluation_frequency                   = "PT15M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "italynorth"
      + name                                   = "[CGN | iopitncgnst01] Failures on pendingdeleteeyca-poison"
      + resource_group_name                    = "io-p-itn-cgn-rg-01"
      + scopes                                 = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Storage/storageAccounts/iopitncgnst01",
        ]
      + severity                               = 1
      + tags                                   = {
          + "BusinessUnit"   = "CGN"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + window_duration                        = "PT15M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-cgn-error-ag-01",
            ]
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                StorageQueueLogs
                  | where OperationName has "PutMessage"
                  | where Uri has "pendingdeleteeyca-poison"
            EOT
          + threshold               = 0
          + time_aggregation_method = "Count"
        }
    }

  # module.functions_cgn_card_02.module.function_app_cgn_card.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          ~ "SERVICES_API_URL"                                                                                 = (sensitive value)
            # (50 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Web/sites/io-p-itn-cgn-card-func-02"
        name                                           = "io-p-itn-cgn-card-func-02"
        tags                                           = {
            "BusinessUnit"                                   = "CGN"
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO CGN"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
            "ModuleVersion"                                  = "0.3.1"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

      ~ sticky_settings {
          ~ app_setting_names       = [
              + "SLOT_TASK_HUBNAME",
              + "AzureFunctionsJobHost__extensions__durableTask__hubName",
                "APPINSIGHTS_SAMPLING_PERCENTAGE",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage",
                "AzureFunctionsWebHost__hostid",
              - "AzureWebJobs.CardsDelete_2_ProcessPendingDeleteCgnQueue.Disabled",
              - "AzureWebJobs.CardsDelete_3_ProcessPendingDeleteEycaQueue.Disabled",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
                "AzureWebJobs.CgnActivation_2_ProcessPendingQueue.Disabled",
                "AzureWebJobs.CgnActivation_3_ProcessActivatedQueue.Disabled",
              - "AzureWebJobs.CgnExpired_1_Start.Disabled",
              - "AzureWebJobs.CgnExpired_2_ProcessExpiredCgnQueue.Disabled",
                "AzureWebJobs.EycaActivation_2_ProcessPendingQueue.Disabled",
                "AzureWebJobs.EycaActivation_3_ProcessActivatedQueue.Disabled",
              + "AzureWebJobs.CardsDelete_2_ProcessPendingDeleteCgnQueue.Disabled",
              + "AzureWebJobs.CardsDelete_3_ProcessPendingDeleteEycaQueue.Disabled",
              + "AzureWebJobs.CgnExpired_1_Start.Disabled",
              + "AzureWebJobs.CgnExpired_2_ProcessExpiredCgnQueue.Disabled",
                "AzureWebJobs.EycaExpired_1_Start.Disabled",
                # (1 unchanged element hidden)
                "AzureWebJobs.SendMessage_ProcessMessagesQueue.Disabled",
              - "SLOT_TASK_HUBNAME",
              - "AzureFunctionsJobHost__extensions__durableTask__hubName",
            ]
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_card_02.module.function_app_cgn_card.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          ~ "SERVICES_API_URL"                                                                                 = (sensitive value)
            # (62 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Web/sites/io-p-itn-cgn-card-func-02/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (29 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 10 to add, 2 to change, 0 to destroy.
```

</details>
